## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 8 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               RESOURCE                               |
|--------|----------------------------------------------------------------------|
| update | `aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts`   |
|        | `aws_cloudwatch_metric_alarm.superset_load_balancer_response_time`   |
|        | `aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts` |
|        | `aws_ssm_parameter.superset_database_host`                           |
|        | `module.celery_beat_ecs.aws_iam_policy.this_task_exec`               |
|        | `module.celery_worker_ecs.aws_iam_policy.this_task_exec`             |
|        | `module.superset_ecs.aws_ecs_service.this`                           |
|        | `module.superset_ecs.aws_iam_policy.this_task_exec`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/ecs-cwagent",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/guest_token_jwt_secret",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/slack_api_token",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_password",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_user",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username",
              + "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key",
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_healthy_hosts" {
      ~ actions_enabled                       = false -> true
        id                                    = "load-balancer-healthy-hosts"
        tags                                  = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_response_time will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_response_time" {
      ~ actions_enabled                       = false -> true
        id                                    = "load-balancer-response-time"
        tags                                  = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_unhealthy_hosts" {
      ~ actions_enabled                       = false -> true
        id                                    = "load-balancer-unhealthy-hosts"
        tags                                  = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)
    }

  # aws_ssm_parameter.superset_database_host will be updated in-place
  ~ resource "aws_ssm_parameter" "superset_database_host" {
        id              = "superset_database_host"
        name            = "superset_database_host"
        tags            = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/celery-beat:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:PutMetricData",
                              + "ec2:DescribeVolumes",
                              + "ec2:DescribeTags",
                              + "logs:PutLogEvents",
                              + "logs:PutRetentionPolicy",
                              + "logs:DescribeLogStreams",
                              + "logs:DescribeLogGroups",
                              + "logs:CreateLogStream",
                              + "logs:CreateLogGroup",
                              + "xray:PutTraceSegments",
                              + "xray:PutTelemetryRecords",
                              + "xray:GetSamplingRules",
                              + "xray:GetSamplingTargets",
                              + "xray:GetSamplingStatisticSummaries",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "CWACloudWatchServerPermissions"
                        },
                      + {
                          + Action   = [
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                          + Sid      = "CWASSMServerPermissions"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::257394494478:policy/celery-beat_ecs_task_exec_policy"
        name             = "celery-beat_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/celery-beat:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_user",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/slack_api_token",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/guest_token_jwt_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/ecs-cwagent",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CWACloudWatchServerPermissions"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                      - Sid      = "CWASSMServerPermissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.celery_worker_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/celery-worker:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:PutMetricData",
                              + "ec2:DescribeVolumes",
                              + "ec2:DescribeTags",
                              + "logs:PutLogEvents",
                              + "logs:PutRetentionPolicy",
                              + "logs:DescribeLogStreams",
                              + "logs:DescribeLogGroups",
                              + "logs:CreateLogStream",
                              + "logs:CreateLogGroup",
                              + "xray:PutTraceSegments",
                              + "xray:PutTelemetryRecords",
                              + "xray:GetSamplingRules",
                              + "xray:GetSamplingTargets",
                              + "xray:GetSamplingStatisticSummaries",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "CWACloudWatchServerPermissions"
                        },
                      + {
                          + Action   = [
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                          + Sid      = "CWASSMServerPermissions"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.celery_worker_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::257394494478:policy/celery-worker_ecs_task_exec_policy"
        name             = "celery-worker_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/celery-worker:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_user",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/slack_api_token",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/guest_token_jwt_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/ecs-cwagent",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CWACloudWatchServerPermissions"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                      - Sid      = "CWASSMServerPermissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.superset_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/superset:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:PutMetricData",
                              + "ec2:DescribeVolumes",
                              + "ec2:DescribeTags",
                              + "logs:PutLogEvents",
                              + "logs:PutRetentionPolicy",
                              + "logs:DescribeLogStreams",
                              + "logs:DescribeLogGroups",
                              + "logs:CreateLogStream",
                              + "logs:CreateLogGroup",
                              + "xray:PutTraceSegments",
                              + "xray:PutTelemetryRecords",
                              + "xray:GetSamplingRules",
                              + "xray:GetSamplingTargets",
                              + "xray:GetSamplingStatisticSummaries",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "CWACloudWatchServerPermissions"
                        },
                      + {
                          + Action   = [
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                          + Sid      = "CWASSMServerPermissions"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:170" -> "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:171"
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::257394494478:policy/superset_ecs_task_exec_policy"
        name             = "superset_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:257394494478:log-group:/aws/ecs/superset/superset:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_user",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_password",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/slack_api_token",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/guest_token_jwt_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:257394494478:parameter/ecs-cwagent",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CWACloudWatchServerPermissions"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:*:*:parameter/AmazonCloudWatch-*"
                      - Sid      = "CWASSMServerPermissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 8 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_bounce_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_complaint_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
